Revit 2027 API
Rebar.IsRebarShapeDriven Method
 Returns true if the rebar is shape driven and false if free form.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsRebarShapeDriven()
Public Function IsRebarShapeDriven As Boolean
public:
bool IsRebarShapeDriven()
member IsRebarShapeDriven : unit -> bool
Return Value
Boolean
 Returns true if the rebar is shape driven and false if free form.
See Also
Reference
Rebar Class
Autodesk.Revit.DB.Structure Namespace